[
  {
    "id": 0,
    "filename": "castleHistory.md",
    "text": "---\ntitle: \"Blackstone Keep\"\ncategory: Location\ntags: [castle, history, monarchy]\n---\n\n# Blackstone Keep\n\n## 1. Overview\n\nPerched atop jagged northern cliffs, Blackstone Keep has defended the realm for over three centuries. Commissioned by Queen Elara Stormborn after the Dragon Wars, its black-granite walls are said to be enchanted against fire.\n\n## 2. Construction & Architecture\n\n- **Built:** 1425 A.D., by order of Queen Elara Stormborn\n- **Materials:** Solid black granite quarried from nearby Blightrock Ridge\n- **Grand Hall:** Vaulted ceiling with murals of the Siege of Wyrewell and the Pact of Truce\n- **Defenses:** Four corner towers, curtain walls fifteen feet thick, a deep dry moat\n\n## 3. Notable Events\n\n- **1623 – The Moonlit Betrayal:** Lord Cassian’s coup attempt; he and his knights were slain in the Grand Hall under moonlight.\n\n## 4. Folklore\n\n- On stormy nights you can hear phantom trumpets echoing through the keep—believed to be the war-horns of a lost battalion.\n\n## 5. Present Day\n\nThough the royal court has moved to Sunreach Palace, Blackstone remains grim and unyielding. Knights still patrol its ramparts by torchlight, ever watchful against threats from the Frostfang Pass."
  },
  {
    "id": 1,
    "filename": "landsOfMidra.md",
    "text": "---\ntitle: \"Lands of Midra\"\ncategory: Region\ntags: [geography, history, cultures, politics]\n---\n\n# 1. Overview\n\nThe realm of Midra stretches from the storm-lashed northern fjords to the rolling plains of the south, where amber grain fields meet glass-blue rivers. Its diverse landscapes have shaped a tapestry of cultures, conflicts, and ancient legends.\n\n---\n\n## 2. Geography & Climate\n\n- **Northern Fjords:** Jagged cliffs, pine forests, perpetual mists\n- **Highwinter Peaks:** Snow-capped mountains home to hardy mountain clans\n- **Emerald Vale:** Fertile lowlands bisected by the River Lysara\n- **Sunrest Desert (south):** Windswept dunes, ruins of the Old Sand Kingdom\n\n_Climate varies from bitter cold in the north to dry heat in the south; spring floods along the Lysara make the central plains exceptionally fertile._\n\n---\n\n## 3. Historical Eras\n\n| Era                   | Date           | Key Events                                        |\n| --------------------- | -------------- | ------------------------------------------------- |\n| Age of the First Dawn | –4000 to –2500 | Founding of the Moonspire City by seafaring clans |\n| Age of Titans         | –2500 to –1000 | Blood Wars between mountain and desert peoples    |\n| Age of Unity          | –1000 to 0     | Unification under the Sapphire Council            |\n| Age of Dragons        | 0 to 500       | Dragon Wars; forging of Blackstone Keep           |\n| Age of Fracture       | 500 to Present | Rise of petty lords; the Pact of Truce (1425 AD)  |\n\n---\n\n## 4. Peoples & Cultures\n\n- **Midran Farmers:** Settled folk in the Emerald Vale, known for grain and ale\n- **Frostborn Clans:** Seafaring warriors of the northern fjords\n- **Dune Nomads:** Caravan traders in the Sunrest Desert\n- **Highpeak Dwarves:** Stone-carvers and smiths dwelling in the Highwinter Peaks\n\n---\n\n## 5. Politics & Factions\n\n- **Sapphire Council:** Ancient ruling body still seated in Moonspire\n- **Pactbreaker Cult:** Secret sect rumored to hatch dragons from old eggs\n- **Guild of the Silver Oath:** Mercenary company enforcing trade routes\n\n---\n\n## 6. Folklore & Legends\n\n- **The Singing Stones:** Glowing monoliths in the desert that hum at dusk\n- **The Weeping Oak:** A giant tree in Emerald Vale said to grant visions\n- **Stormcaller’s Tear:** A lost orb that can summon tempests at sea\n\n_Travelers swear the wind carries distant voices near the Singing Stones—and that those who listen too long never return the same._"
  },
  {
    "id": 2,
    "filename": "maribel.md",
    "text": "---\nname: \"Maribel the Merchant\"\ncategory: NPC\ntags: [shopkeeper, Riverwood, friendly]\n---\n\n# Maribel the Merchant\n\n**Role:** Proprietor of Riverwood Sundries  \n**Location:** Riverwood  \n**Age:** Mid-50s  \n**Appearance:** Warm-faced, auburn hair in a loose bun, colorful shawl over simple linen dress  \n**Equipment:** Wicker basket of fresh bread, small iron-bound ledger\n\n---\n\n## Backstory\n\nMaribel has run “Riverwood Sundries” for over twenty years. Before settling here, she traveled as far as the Scarlet Coast, trading and gathering exotic wares for her shelves.\n\n## Personality\n\n- **Friendly & Hospitable:** Always offers a loaf of fresh bread to newcomers\n- **Keen-Eyed:** Notices every detail—prices, people, and hidden tensions\n- **Shrewd Businesswoman:** Fair prices, but never misses an opportunity to haggle\n\n## Wares & Skills\n\n- **Trinkets:** Desert-dyed scarves, Shadowlands obsidian arrowheads, spiced-honey jars\n- **Discount:** A genuine compliment can shave a few coins off your total\n- **Bartering:** Expert at reading customers’ needs and fears\n\n## Quirks & Secrets\n\n- **Quirk:** Hums an old lullaby whenever she’s pleased\n- **Favorite Item:** A carved walnut music box that plays the same lullaby\n- **Secret:** Keeps a hidden ledger of “special” customers—and once served as a spy for the King’s court"
  },
  {
    "id": 3,
    "filename": "sir_roland.md",
    "text": "---\nname: \"Sir Roland Ashford\"\ncategory: NPC\ntags: [guard, knight, loyal, castle]\n---\n\n# Sir Roland Ashford\n\n**Role:** Senior Castle Guard of Blackstone Keep  \n**Age:** 37  \n**Appearance:** Broad-shouldered, cropped dark hair, a long scar runs down his left cheek  \n**Equipment:** Father’s heirloom greatsword, polished steel breastplate etched with the keep’s crest\n\n---\n\n## Backstory\n\nBorn the son of a blacksmith from Raven’s Hollow, Roland enlisted in the Queen’s Guard at sixteen. He earned his spurs defending the northern passes during the Frostfang Invasion and was promoted to Senior Guard three years ago.\n\n---\n\n## Personality\n\n- **Honorable & Dutiful:** Upholds his oaths above all else\n- **Stoic:** Speaks little, but listens intently\n- **Protective:** Sees every traveler under his watch as his charge\n\n---\n\n## Motivations & Goals\n\n1. Safeguard Blackstone Keep against any threat\n2. Prove himself worthy of knighthood by Queen Elara\n3. Investigate rumors of the Pactbreaker Cult stirring in the hills\n\n---\n\n## Quirks & Secrets\n\n- **Quirk:** Polishes his greatsword blade at dawn each day\n- **Secret:** Haunted by guilt over a comrade who fell under his watch\n\n---"
  }
]